#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.local_file.vst_config: Refreshing state... [id=42fbeba9537df670e6681404d6e34fb6893634c0]
module.backend.stripe_product.vst["cool-synth-v1"]: Refreshing state... [id=prod_U1SInllK5crk4M]
module.backend.data.archive_file.checkout_zip: Reading...
module.backend.stripe_product.vst["retro-verb-v1"]: Refreshing state... [id=prod_U1SIEvbdLWIMKe]
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.download_zip: Reading...
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.my_purchases_zip: Reading...
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=e9b02f517e52118061d145bcd703caedbc5e6858]
module.backend.data.archive_file.my_purchases_zip: Read complete after 0s [id=cdb72f57c6a904c8cfb8062b50e33356f1239e55]
module.backend.data.archive_file.download_zip: Read complete after 0s [id=fbef8255c1eb83c043fba717bc78b76310fbb690]
module.backend.data.archive_file.checkout_zip: Read complete after 0s [id=89858a795770ef58dc4c479873987033749c1728]
module.backend.stripe_price.vst_price["cool-synth-v1"]: Refreshing state... [id=price_1T3PNzDyEyPnHPBnZfnovW9O]
module.backend.stripe_price.vst_price["retro-verb-v1"]: Refreshing state... [id=price_1T3PNzDyEyPnHPBnBSi6RYWa]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-dev]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 0s [id=fdb199895e54393e72c0801a046176da56b4a400]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:21]
module.backend.aws_api_gateway_resource.checkout: Refreshing state... [id=hghcjv]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=uilktp]
module.backend.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-g6jnm33pu7-DEFAULT_4XX]
module.backend.aws_api_gateway_resource.download: Refreshing state... [id=e02sjc]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-g6jnm33pu7-uilktp-POST]
module.backend.module.download_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.module.checkout_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.checkout_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.checkout_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-dev]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.module.checkout_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.aws_api_gateway_method.checkout_post: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-POST]
module.backend.aws_api_gateway_method.download_get: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-GET]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-g6jnm33pu7-uilktp-POST]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_lambda_function.download: Refreshing state... [id=vstshop-download-dev]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.backend.aws_lambda_function.checkout: Refreshing state... [id=vstshop-checkout-dev]
module.backend.aws_lambda_permission.apigw_download: Refreshing state... [id=AllowExecutionFromAPIGatewayDownload]
module.backend.aws_api_gateway_integration.download_integration: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-GET]
module.backend.aws_lambda_permission.apigw_checkout: Refreshing state... [id=AllowExecutionFromAPIGatewayCheckout]
module.backend.aws_api_gateway_integration.checkout_integration: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-POST]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=zn3ian]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]
local_file.env_file: Refreshing state... [id=9ebf127f4251f8d1098d9b223024616c10c89532]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_V9hhjw2Y5
            VITE_USER_POOL_CLIENT_ID=2p1utd8g6jkts9qp59n7b5k9le
            VITE_API_URL=https://g6jnm33pu7.execute-api.us-east-2.amazonaws.com/dev
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date = "2026-02-22T01:56:05Z" -> (known after apply)
      ~ id           = "zn3ian" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "3b7f5c0ba86610e109be66daa7b3e4d88178ddd9"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-g6jnm33pu7-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_integration.my_purchases_int will be created
  + resource "aws_api_gateway_integration" "my_purchases_int" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "us-east-2"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "g6jnm33pu7"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.backend.aws_api_gateway_method.my_purchases_get will be created
  + resource "aws_api_gateway_method" "my_purchases_get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "7wqxx7"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "us-east-2"
      + resource_id      = (known after apply)
      + rest_api_id      = "g6jnm33pu7"
    }

  # module.backend.aws_api_gateway_resource.my_purchases will be created
  + resource "aws_api_gateway_resource" "my_purchases" {
      + id          = (known after apply)
      + parent_id   = "rv8oylouqe"
      + path        = (known after apply)
      + path_part   = "my-purchases"
      + region      = "us-east-2"
      + rest_api_id = "g6jnm33pu7"
    }

  # module.backend.aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "zn3ian" -> (known after apply)
        id                    = "ags-g6jnm33pu7-dev"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_function.checkout will be updated in-place
  ~ resource "aws_lambda_function" "checkout" {
        id                             = "vstshop-checkout-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:21",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.my_purchases will be created
  + resource "aws_lambda_function" "my_purchases" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../../modules/vstshop/backend/lambda/my_purchases.zip"
      + function_name                  = "vstshop-my-purchases-dev"
      + handler                        = "my_purchases.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::195481994910:role/vstshop-lambda-role-dev"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "iGwN0q3m9LsIKUiKCL+ESba2dk6RPx8QQsNp9NC9ayk="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "vstshop-purchases-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:21",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:21" -> (known after apply)
      ~ code_sha256                 = "mTgspjFAE0vztm91KSZ7gbdWf2jkxwa3sWzQ49Sy18Y=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-22T01:55:59.867+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:21" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "mTgspjFAE0vztm91KSZ7gbdWf2jkxwa3sWzQ49Sy18Y=" -> "3/2sKbCy01DXyNRZ25Ljr0xgouY1J768TSwR0tlPR/k=" # forces replacement
      ~ source_code_size            = 4677963 -> (known after apply)
      ~ version                     = "21" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_permission.api_gw_my_purchases will be created
  + resource "aws_lambda_permission" "api_gw_my_purchases" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "vstshop-my-purchases-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = "arn:aws:execute-api:us-east-2:195481994910:g6jnm33pu7/*/*"
      + statement_id        = "AllowExecutionFromAPIGatewayPurchases"
      + statement_id_prefix = (known after apply)
    }

  # module.backend.local_file.vst_config will be created
  + resource "local_file" "vst_config" {
      + content              = jsonencode(
            [
              + {
                  + id    = "cool-synth-v1"
                  + name  = "Cool Synth VST"
                  + price = "$29.99"
                },
              + {
                  + id    = "retro-verb-v1"
                  + name  = "Retro Verb VST"
                  + price = "$19.99"
                },
            ]
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../../modules/vstshop/backend/../../../../services/vstshop-frontend/src/product_config.json"
      + id                   = (known after apply)
    }

  # module.backend.module.my_purchases_cors.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "us-east-2"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "g6jnm33pu7"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.backend.module.my_purchases_cors.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "us-east-2"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = "g6jnm33pu7"
      + status_code         = "200"
    }

  # module.backend.module.my_purchases_cors.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "us-east-2"
      + resource_id      = (known after apply)
      + rest_api_id      = "g6jnm33pu7"
    }

  # module.backend.module.my_purchases_cors.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "us-east-2"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = "g6jnm33pu7"
      + status_code         = "200"
    }

Plan: 13 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>